{
  "Comment.nvim": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "aerial.nvim": { "branch": "master" },
  "blame.nvim": { "branch": "main" },
  "circadian.nvim": { "branch": "trunk" },
  "clangd_extensions.nvim": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "diffview.nvim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "flash.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "grug-far.nvim": { "branch": "main" },
  "gruvbox-material": { "branch": "master" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "log-highlight.nvim": { "branch": "main" },
  "lspkind.nvim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "mini.nvim": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lsp-file-operations": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "obsidian.nvim": { "branch": "main" },
  "oil.nvim": { "branch": "master" },
  "overseer.nvim": { "branch": "master" },
  "persistence.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
  "smart-splits.nvim": { "branch": "master" },
  "snacks.nvim": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-live-grep-args.nvim": { "branch": "master" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "telescope-undo.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "0.1.x" },
  "todo-comments.nvim": { "branch": "main" },
  "tokyonight.nvim": { "branch": "main" },
  "tree-sitter-nu": { "branch": "main" },
  "twilight.nvim": { "branch": "main" },
  "undotree": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-maximizer": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "yanky.nvim": { "branch": "main" },
  "yazi.nvim": { "branch": "main" }
}
